import { AccordionItem } from './AccordionProps';

const ACOORDION_ITEMS: AccordionItem[] = [
  {
    header: 'قیمت یک لپ تاپ مناسب در بازار ایران چقدر است ؟',
    content: (
      <p>
        نوت‌بوک‌های ارزان قیمت یا کروم‌بوک که دارای سیستم عامل کروم هستند یا سیستم‌های ویندوز سطح
        پایین با کمترین حافظه و پردازنده‌های کند هستند مانند HP Stream 11 و Dell Inspiron 11 3000.
        آن‌ها را به عنوان کامپیوترهای ثانویه به کار بگیرید یا به کودکان بدهید.
      </p>
    ),
    value: 'item-1',
    id: 'item-1',
  },
  {
    header: 'بهترین برند لپ‌تاپ کدام است؟',
    content: <p>اطلاعی ندارم</p>,
    value: 'item-2',
    id: 'item-2',
  },
  {
    header: 'مک، ویندوز یا سیستم عامل کروم؟',
    content: (
      <p>
        نوت‌بوک‌های ارزان قیمت یا کروم‌بوک که دارای سیستم عامل کروم هستند یا سیستم‌های ویندوز سطح
        پایین با کمترین حافظه و پردازنده‌های کند هستند مانند HP Stream 11 و Dell Inspiron 11 3000.
        آن‌ها را به عنوان کامپیوترهای ثانویه به کار بگیرید یا به کودکان بدهید.
      </p>
    ),
    value: 'item-3',
    id: 'item-3',
  },
  {
    header: 'چه اندازه و وزنی بری لپ‌تاپ مناسب است؟',
    content: (
      <p>
        نوت‌بوک‌های ارزان قیمت یا کروم‌بوک که دارای سیستم عامل کروم هستند یا سیستم‌های ویندوز سطح
        پایین با کمترین حافظه و پردازنده‌های کند هستند مانند HP Stream 11 و Dell Inspiron 11 3000.
        آن‌ها را به عنوان کامپیوترهای ثانویه به کار بگیرید یا به کودکان بدهید.
      </p>
    ),
    value: 'item-4',
    id: 'item-4',
  },
  {
    header: 'چگونه رم مناسب در هنگام خرید لپ تاپ را پیدا کنیم؟',
    content: (
      <p>
        نوت‌بوک‌های ارزان قیمت یا کروم‌بوک که دارای سیستم عامل کروم هستند یا سیستم‌های ویندوز سطح
        پایین با کمترین حافظه و پردازنده‌های کند هستند مانند HP Stream 11 و Dell Inspiron 11 3000.
        آن‌ها را به عنوان کامپیوترهای ثانویه به کار بگیرید یا به کودکان بدهید.
      </p>
    ),
    value: 'item-5',
    id: 'item-5',
  },
];

export default ACOORDION_ITEMS;
